[
  {"id": 1, "task": "Say 'Hi' to someone new."},
  {"id": 2, "task": "Compliment a stranger."},
  {"id": 3, "task": "Ask someone how their day is going."},
  {"id": 4, "task": "Offer to help someone with their groceries."},
  {"id": 5, "task": "Hold the door open for someone."},
  {"id": 6, "task": "Smile at five strangers today."},
  {"id": 7, "task": "Start a conversation with someone in a café."},
  {"id": 8, "task": "Ask someone what book they are reading."},
  {"id": 9, "task": "Say 'thank you' to a service worker."},
  {"id": 10, "task": "Ask for someone's name when meeting them."},
  {"id": 11, "task": "Share a joke with someone."},
  {"id": 12, "task": "Invite a colleague for coffee."},
  {"id": 13, "task": "Join a group activity in a park (like yoga or running)."},
  {"id": 14, "task": "Comment positively on someone’s outfit."},
  {"id": 15, "task": "Ask a neighbor how they've been."},
  {"id": 16, "task": "Offer to walk a friend’s dog."},
  {"id": 17, "task": "Help someone carry their bags."},
  {"id": 18, "task": "Compliment someone on their hairstyle."},
  {"id": 19, "task": "Initiate a chat with someone at a bus stop."},
  {"id": 20, "task": "Talk to the cashier about their day."},
  {"id": 21, "task": "Take a walk in the park and greet everyone you pass."},
  {"id": 22, "task": "Visit a local market and talk to a vendor."},
  {"id": 23, "task": "Go to a café and compliment the barista on their service."},
  {"id": 24, "task": "Ask someone for directions even if you know the way."},
  {"id": 25, "task": "Start a conversation while waiting in line."},
  {"id": 26, "task": "Attend a community event and introduce yourself to someone."},
  {"id": 27, "task": "Visit a bookstore and ask for a recommendation."},
  {"id": 28, "task": "Participate in a group sport or fitness class."},
  {"id": 29, "task": "Attend a local art gallery and chat with other visitors."},
  {"id": 30, "task": "Join a volunteer activity and introduce yourself to others."},
  {"id": 31, "task": "Ask someone what their favorite movie is."},
  {"id": 32, "task": "Challenge someone to a quick game (e.g., rock-paper-scissors)."},
  {"id": 33, "task": "Offer to take a photo for a couple or group."},
  {"id": 34, "task": "Join a local hobby club and make a new friend."},
  {"id": 35, "task": "Attend a workshop and ask someone how they found out about it."},
  {"id": 36, "task": "Compliment someone’s shoes."},
  {"id": 37, "task": "Ask someone their favorite restaurant in town."},
  {"id": 38, "task": "Share your favorite hobby with someone new."},
  {"id": 39, "task": "Recommend a movie or show to someone."},
  {"id": 40, "task": "Offer to share your umbrella when it rains."},
  {"id": 41, "task": "Leave a nice note on someone’s windshield."},
  {"id": 42, "task": "Share a positive story or memory with someone."},
  {"id": 43, "task": "Bring snacks to a gathering and share them."},
  {"id": 44, "task": "Ask a friend or stranger how they’re feeling today."},
  {"id": 45, "task": "Offer to water someone’s plants."},
  {"id": 46, "task": "Buy a coffee for the person behind you in line."},
  {"id": 47, "task": "Compliment someone’s smile."},
  {"id": 48, "task": "Write a short thank-you note to someone."},
  {"id": 49, "task": "Start a conversation with someone who looks lonely."},
  {"id": 50, "task": "Offer a seat to someone on public transport."},
  {"id": 51, "task": "Attend a cultural event and talk to someone from a different background."},
  {"id": 52, "task": "Try a new cuisine and chat with the server about their recommendations."},
  {"id": 53, "task": "Learn how to say 'hello' in a different language and greet someone with it."},
  {"id": 54, "task": "Visit a local museum and discuss an exhibit with a fellow visitor."},
  {"id": 55, "task": "Attend a festival and make a friend at a food stall."},
  {"id": 56, "task": "Invite a neighbor for a walk."},
  {"id": 57, "task": "Organize a group walk or outdoor activity with friends."},
  {"id": 58, "task": "Attend a live music event and start a conversation with someone there."},
  {"id": 59, "task": "Join a meetup group and introduce yourself."},
  {"id": 60, "task": "Ask someone if they want to join you for an outdoor workout."},
  {"id": 61, "task": "Visit a local garden and strike up a conversation with someone there."},
  {"id": 62, "task": "Ask someone how they like to de-stress."},
  {"id": 63, "task": "Recommend a meditation or relaxation app to a friend."},
  {"id": 64, "task": "Invite a friend to a yoga class."},
  {"id": 65, "task": "Walk through a quiet park and say 'good morning' to people you pass."},
  {"id": 66, "task": "Go to a tea shop and ask the staff what their favorite blend is."},
  {"id": 67, "task": "Attend a meditation session and chat with someone afterward."},
  {"id": 68, "task": "Join a local walking tour and make a friend."},
  {"id": 69, "task": "Offer to share your favorite relaxation tips with someone."},
  {"id": 70, "task": "Take part in a local nature walk and greet fellow walkers."},
  {"id": 71, "task": "Ask someone about their favorite childhood game."},
  {"id": 72, "task": "Organize a board game night with neighbors."},
  {"id": 73, "task": "Start a casual chat while playing Pokémon Go or a similar game."},
  {"id": 74, "task": "Join a public game of frisbee or soccer."},
  {"id": 75, "task": "Challenge someone to a quick trivia game."},
  {"id": 76, "task": "Ask someone what their favorite outdoor activity is."},
  {"id": 77, "task": "Share a fun fact with a stranger."},
  {"id": 78, "task": "Invite someone to try a new hobby with you."},
  {"id": 79, "task": "Play catch with a friend or a stranger."},
  {"id": 80, "task": "Start a spontaneous dance-off in a public park."},
  {"id": 81, "task": "Buy flowers and hand them to a stranger."},
  {"id": 82, "task": "Compliment someone’s pet and chat with the owner."},
  {"id": 83, "task": "Offer to take a group photo for tourists."},
  {"id": 84, "task": "Leave an uplifting note in a public place."},
  {"id": 85, "task": "Buy a small gift for someone just because."},
  {"id": 86, "task": "Pay for the person behind you in line at a café."},
  {"id": 87, "task": "Offer your help to someone who looks like they need it."},
  {"id": 88, "task": "Compliment a parent on how cute their child is."},
  {"id": 89, "task": "Leave a thank-you note for your local mail carrier."},
  {"id": 90, "task": "Offer to help someone with their luggage."},
  {"id": 91, "task": "Ask someone for a restaurant recommendation."},
  {"id": 92, "task": "Take a different route home and ask someone about the area."},
  {"id": 93, "task": "Attend a book signing or talk and chat with others in attendance."},
  {"id": 94, "task": "Go to a food truck and talk to someone while waiting."},
  {"id": 95, "task": "Visit a local landmark and ask someone to take a photo of you."},
  {"id": 96, "task": "Ask someone for tips on exploring a new area."},
  {"id": 97, "task": "Chat with a local artist about their work."},
  {"id": 98, "task": "Attend a farmer’s market and ask a vendor about their produce."},
  {"id": 99, "task": "Visit a café and ask the barista about their favorite drink."},
  {"id": 100, "task": "Join a language exchange group and start chatting with someone new."}
]
